app/controllers/students_controller.rb

  def create
    @student = Student.new
    @student.student_first_name = params[:student_first_name]
    @student.student_last_name = params[:student_last_name]
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-07-01 15:50:46.570013"], ["updated_at", "2018-07-01 15:50:46.570013"]]

  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-07-01 16:07:52.744037"], ["id", 1]]